OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf1777.c
__at(0x031B) __sfr MD2CON0;
__at(0x031B) volatile __MD2CON0bits_t MD2CON0bits;

__at(0x031C) __sfr MD2CON1;
__at(0x031C) volatile __MD2CON1bits_t MD2CON1bits;

__at(0x031D) __sfr MD2SRC;
__at(0x031D) volatile __MD2SRCbits_t MD2SRCbits;

__at(0x031E) __sfr MD2CARL;
__at(0x031E) volatile __MD2CARLbits_t MD2CARLbits;

__at(0x031F) __sfr MD2CARH;
__at(0x031F) volatile __MD2CARHbits_t MD2CARHbits;

__at(0x038C) __sfr INLVLA;
__at(0x038C) volatile __INLVLAbits_t INLVLAbits;

__at(0x038D) __sfr INLVLB;
__at(0x038D) volatile __INLVLBbits_t INLVLBbits;

__at(0x038E) __sfr INLVLC;
__at(0x038E) volatile __INLVLCbits_t INLVLCbits;

__at(0x038F) __sfr INLVLD;
__at(0x038F) volatile __INLVLDbits_t INLVLDbits;

__at(0x0390) __sfr INLVE;
__at(0x0390) volatile __INLVEbits_t INLVEbits;

__at(0x0391) __sfr IOCAP;
__at(0x0391) volatile __IOCAPbits_t IOCAPbits;

__at(0x0392) __sfr IOCAN;
__at(0x0392) volatile __IOCANbits_t IOCANbits;

__at(0x0393) __sfr IOCAF;
__at(0x0393) volatile __IOCAFbits_t IOCAFbits;

__at(0x0394) __sfr IOCBP;
__at(0x0394) volatile __IOCBPbits_t IOCBPbits;

__at(0x0395) __sfr IOCBN;
__at(0x0395) volatile __IOCBNbits_t IOCBNbits;

__at(0x0396) __sfr IOCBF;
__at(0x0396) volatile __IOCBFbits_t IOCBFbits;

__at(0x0397) __sfr IOCCP;
__at(0x0397) volatile __IOCCPbits_t IOCCPbits;

__at(0x0398) __sfr IOCCN;
__at(0x0398) volatile __IOCCNbits_t IOCCNbits;

__at(0x0399) __sfr IOCCF;
__at(0x0399) volatile __IOCCFbits_t IOCCFbits;

__at(0x039D) __sfr IOCEP;
__at(0x039D) volatile __IOCEPbits_t IOCEPbits;

__at(0x039E) __sfr IOCEN;
__at(0x039E) volatile __IOCENbits_t IOCENbits;

__at(0x039F) __sfr IOCEF;
__at(0x039F) volatile __IOCEFbits_t IOCEFbits;

__at(0x040D) __sfr HIDRVB;
__at(0x040D) volatile __HIDRVBbits_t HIDRVBbits;

__at(0x040F) __sfr TMR5;

__at(0x040F) __sfr TMR5L;

__at(0x0410) __sfr TMR5H;

__at(0x0411) __sfr T5CON;
__at(0x0411) volatile __T5CONbits_t T5CONbits;

__at(0x0412) __sfr T5GCON;
__at(0x0412) volatile __T5GCONbits_t T5GCONbits;

__at(0x0413) __sfr T4TMR;

__at(0x0413) __sfr TMR4;

__at(0x0414) __sfr PR4;

__at(0x0414) __sfr T4PR;

__at(0x0415) __sfr T4CON;
__at(0x0415) volatile __T4CONbits_t T4CONbits;

__at(0x0416) __sfr T4HLT;
__at(0x0416) volatile __T4HLTbits_t T4HLTbits;

__at(0x0417) __sfr T4CLKCON;
__at(0x0417) volatile __T4CLKCONbits_t T4CLKCONbits;

__at(0x0418) __sfr T4RST;
__at(0x0418) volatile __T4RSTbits_t T4RSTbits;

__at(0x041A) __sfr T6TMR;

__at(0x041A) __sfr TMR6;

__at(0x041B) __sfr PR6;

__at(0x041B) __sfr T6PR;

__at(0x041C) __sfr T6CON;
__at(0x041C) volatile __T6CONbits_t T6CONbits;

__at(0x041D) __sfr T6HLT;
__at(0x041D) volatile __T6HLTbits_t T6HLTbits;

__at(0x041E) __sfr T6CLKCON;
__at(0x041E) volatile __T6CLKCONbits_t T6CLKCONbits;

__at(0x041F) __sfr T6RST;
__at(0x041F) volatile __T6RSTbits_t T6RSTbits;

__at(0x048E) __sfr ADRESL;

__at(0x048F) __sfr ADRESH;

__at(0x0490) __sfr ADCON0;
__at(0x0490) volatile __ADCON0bits_t ADCON0bits;

__at(0x0491) __sfr ADCON1;
__at(0x0491) volatile __ADCON1bits_t ADCON1bits;

__at(0x0492) __sfr ADCON2;

__at(0x0493) __sfr T2TMR;

__at(0x0493) __sfr TMR2;

__at(0x0494) __sfr PR2;

__at(0x0494) __sfr T2PR;

__at(0x0495) __sfr T2CON;
__at(0x0495) volatile __T2CONbits_t T2CONbits;

__at(0x0496) __sfr T2HLT;
__at(0x0496) volatile __T2HLTbits_t T2HLTbits;

__at(0x0497) __sfr T2CLKCON;
__at(0x0497) volatile __T2CLKCONbits_t T2CLKCONbits;

__at(0x0498) __sfr T2RST;
__at(0x0498) volatile __T2RSTbits_t T2RSTbits;

__at(0x049A) __sfr T8TMR;

__at(0x049A) __sfr TMR8;

__at(0x049B) __sfr PR8;

__at(0x049B) __sfr T8PR;

__at(0x049C) __sfr T8CON;
__at(0x049C) volatile __T8CONbits_t T8CONbits;

__at(0x049D) __sfr T8HLT;
__at(0x049D) volatile __T8HLTbits_t T8HLTbits;

__at(0x049E) __sfr T8CLKCON;
__at(0x049E) volatile __T8CLKCONbits_t T8CLKCONbits;

__at(0x049F) __sfr T8RST;
__at(0x049F) volatile __T8RSTbits_t T8RSTbits;

__at(0x050F) __sfr OPA1NCHS;

__at(0x0510) __sfr OPA1PCHS;

__at(0x0511) __sfr OPA1CON;
__at(0x0511) volatile __OPA1CONbits_t OPA1CONbits;

__at(0x0512) __sfr OPA1ORS;

__at(0x0513) __sfr OPA2NCHS;

__at(0x0514) __sfr OPA2PCHS;

__at(0x0515) __sfr OPA2CON;
__at(0x0515) volatile __OPA2CONbits_t OPA2CONbits;

__at(0x0516) __sfr OPA2ORS;

__at(0x0517) __sfr OPA3NCHS;

__at(0x0518) __sfr OPA3PCHS;

__at(0x0519) __sfr OPA3CON;
__at(0x0519) volatile __OPA3CONbits_t OPA3CONbits;

__at(0x051A) __sfr OPA3ORS;

__at(0x051B) __sfr OPA4NCHS;

__at(0x051C) __sfr OPA4PCHS;

__at(0x051D) __sfr OPA4CON;
__at(0x051D) volatile __OPA4CONbits_t OPA4CONbits;

__at(0x051E) __sfr OPA4ORS;

__at(0x058D) __sfr DACLD;
__at(0x058D) volatile __DACLDbits_t DACLDbits;

__at(0x058E) __sfr DAC1CON0;
__at(0x058E) volatile __DAC1CON0bits_t DAC1CON0bits;

__at(0x058F) __sfr DAC1CON1;
__at(0x058F) volatile __DAC1CON1bits_t DAC1CON1bits;

__at(0x058F) __sfr DAC1REF;

__at(0x058F) __sfr DAC1REFL;
__at(0x058F) volatile __DAC1REFLbits_t DAC1REFLbits;

__at(0x0590) __sfr DAC1CON2;
__at(0x0590) volatile __DAC1CON2bits_t DAC1CON2bits;

__at(0x0590) __sfr DAC1REFH;
__at(0x0590) volatile __DAC1REFHbits_t DAC1REFHbits;

__at(0x0591) __sfr DAC2CON0;
__at(0x0591) volatile __DAC2CON0bits_t DAC2CON0bits;

__at(0x0592) __sfr DAC2CON1;
__at(0x0592) volatile __DAC2CON1bits_t DAC2CON1bits;

__at(0x0592) __sfr DAC2REF;

__at(0x0592) __sfr DAC2REFL;
__at(0x0592) volatile __DAC2REFLbits_t DAC2REFLbits;

__at(0x0593) __sfr DAC2CON2;
__at(0x0593) volatile __DAC2CON2bits_t DAC2CON2bits;

__at(0x0593) __sfr DAC2REFH;
__at(0x0593) volatile __DAC2REFHbits_t DAC2REFHbits;

__at(0x0594) __sfr DAC3CON0;
__at(0x0594) volatile __DAC3CON0bits_t DAC3CON0bits;

__at(0x0595) __sfr DAC3CON1;
__at(0x0595) volatile __DAC3CON1bits_t DAC3CON1bits;

__at(0x0595) __sfr DAC3REF;
__at(0x0595) volatile __DAC3REFbits_t DAC3REFbits;

__at(0x0596) __sfr DAC4CON0;
__at(0x0596) volatile __DAC4CON0bits_t DAC4CON0bits;

__at(0x0597) __sfr DAC4CON1;
__at(0x0597) volatile __DAC4CON1bits_t DAC4CON1bits;

__at(0x0597) __sfr DAC4REF;
__at(0x0597) volatile __DAC4REFbits_t DAC4REFbits;

__at(0x0598) __sfr DAC5CON0;
__at(0x0598) volatile __DAC5CON0bits_t DAC5CON0bits;

__at(0x0599) __sfr DAC5CON1;
__at(0x0599) volatile __DAC5CON1bits_t DAC5CON1bits;

__at(0x0599) __sfr DAC5REF;

__at(0x0599) __sfr DAC5REFL;
__at(0x0599) volatile __DAC5REFLbits_t DAC5REFLbits;

